c2f1413183766e104ce4b329feaad353/update/sys_soap_message_function_146a1dd2830ba6104ce4b329feaad383.xml

<?xml version="1.0" encoding="UTF-8"?><record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type>basic</authentication_type>
        <basic_auth_password/>
        <basic_auth_profile display_value="Aryan">3689d992830ba6104ce4b329feaad367</basic_auth_profile>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.service-now.com/incident">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:insert>
         <!--Optional:-->
         <active>${insert.active}</active>
         <!--Optional:-->
         <activity_due>${insert.activity_due}</activity_due>
         <!--Optional:-->
         <additional_assignee_list>${insert.additional_assignee_list}</additional_assignee_list>
         <!--Optional:-->
         <approval>${insert.approval}</approval>
         <!--Optional:-->
         <approval_history>${insert.approval_history}</approval_history>
         <!--Optional:-->
         <approval_set>${insert.approval_set}</approval_set>
         <!--Optional:-->
         <assigned_to>${insert.assigned_to}</assigned_to>
         <!--Optional:-->
         <assignment_group>${insert.assignment_group}</assignment_group>
         <!--Optional:-->
         <business_duration>${insert.business_duration}</business_duration>
         <!--Optional:-->
         <business_impact>${insert.business_impact}</business_impact>
         <!--Optional:-->
         <business_service>${insert.business_service}</business_service>
         <!--Optional:-->
         <business_stc>${insert.business_stc}</business_stc>
         <!--Optional:-->
         <calendar_duration>${insert.calendar_duration}</calendar_duration>
         <!--Optional:-->
         <calendar_stc>${insert.calendar_stc}</calendar_stc>
         <!--Optional:-->
         <caller_id>${insert.caller_id}</caller_id>
         <!--Optional:-->
         <category>${insert.category}</category>
         <!--Optional:-->
         <cause>${insert.cause}</cause>
         <!--Optional:-->
         <caused_by>${insert.caused_by}</caused_by>
         <!--Optional:-->
         <child_incidents>${insert.child_incidents}</child_incidents>
         <!--Optional:-->
         <close_code>${insert.close_code}</close_code>
         <!--Optional:-->
         <close_notes>${insert.close_notes}</close_notes>
         <!--Optional:-->
         <closed_at>${insert.closed_at}</closed_at>
         <!--Optional:-->
         <closed_by>${insert.closed_by}</closed_by>
         <!--Optional:-->
         <cmdb_ci>${insert.cmdb_ci}</cmdb_ci>
         <!--Optional:-->
         <comments>${insert.comments}</comments>
         <!--Optional:-->
         <comments_and_work_notes>${insert.comments_and_work_notes}</comments_and_work_notes>
         <!--Optional:-->
         <company>${insert.company}</company>
         <!--Optional:-->
         <contact_type>${insert.contact_type}</contact_type>
         <!--Optional:-->
         <contract>${insert.contract}</contract>
         <!--Optional:-->
         <correlation_display>${insert.correlation_display}</correlation_display>
         <!--Optional:-->
         <correlation_id>${insert.correlation_id}</correlation_id>
         <!--Optional:-->
         <delivery_plan>${insert.delivery_plan}</delivery_plan>
         <!--Optional:-->
         <delivery_task>${insert.delivery_task}</delivery_task>
         <!--Optional:-->
         <description>${insert.description}</description>
         <!--Optional:-->
         <due_date>${insert.due_date}</due_date>
         <!--Optional:-->
         <escalation>${insert.escalation}</escalation>
         <!--Optional:-->
         <expected_start>${insert.expected_start}</expected_start>
         <!--Optional:-->
         <follow_up>${insert.follow_up}</follow_up>
         <!--Optional:-->
         <group_list>${insert.group_list}</group_list>
         <!--Optional:-->
         <hold_reason>${insert.hold_reason}</hold_reason>
         <!--Optional:-->
         <impact>${insert.impact}</impact>
         <!--Optional:-->
         <incident_state>${insert.incident_state}</incident_state>
         <!--Optional:-->
         <knowledge>${insert.knowledge}</knowledge>
         <!--Optional:-->
         <location>${insert.location}</location>
         <!--Optional:-->
         <made_sla>${insert.made_sla}</made_sla>
         <!--Optional:-->
         <notify>${insert.notify}</notify>
         <!--Optional:-->
         <number>${insert.number}</number>
         <!--Optional:-->
         <opened_at>${insert.opened_at}</opened_at>
         <!--Optional:-->
         <opened_by>${insert.opened_by}</opened_by>
         <!--Optional:-->
         <order>${insert.order}</order>
         <!--Optional:-->
         <origin_id>${insert.origin_id}</origin_id>
         <!--Optional:-->
         <origin_table>${insert.origin_table}</origin_table>
         <!--Optional:-->
         <parent>${insert.parent}</parent>
         <!--Optional:-->
         <parent_incident>${insert.parent_incident}</parent_incident>
         <!--Optional:-->
         <priority>${insert.priority}</priority>
         <!--Optional:-->
         <problem_id>${insert.problem_id}</problem_id>
         <!--Optional:-->
         <reassignment_count>${insert.reassignment_count}</reassignment_count>
         <!--Optional:-->
         <reopen_count>${insert.reopen_count}</reopen_count>
         <!--Optional:-->
         <reopened_by>${insert.reopened_by}</reopened_by>
         <!--Optional:-->
         <reopened_time>${insert.reopened_time}</reopened_time>
         <!--Optional:-->
         <resolved_at>${insert.resolved_at}</resolved_at>
         <!--Optional:-->
         <resolved_by>${insert.resolved_by}</resolved_by>
         <!--Optional:-->
         <rfc>${insert.rfc}</rfc>
         <!--Optional:-->
         <route_reason>${insert.route_reason}</route_reason>
         <!--Optional:-->
         <service_offering>${insert.service_offering}</service_offering>
         <!--Optional:-->
         <severity>${insert.severity}</severity>
         <!--Optional:-->
         <short_description>${insert.short_description}</short_description>
         <!--Optional:-->
         <sla_due>${insert.sla_due}</sla_due>
         <!--Optional:-->
         <state>${insert.state}</state>
         <!--Optional:-->
         <subcategory>${insert.subcategory}</subcategory>
         <!--Optional:-->
         <task_effective_number>${insert.task_effective_number}</task_effective_number>
         <!--Optional:-->
         <time_worked>${insert.time_worked}</time_worked>
         <!--Optional:-->
         <universal_request>${insert.universal_request}</universal_request>
         <!--Optional:-->
         <upon_approval>${insert.upon_approval}</upon_approval>
         <!--Optional:-->
         <upon_reject>${insert.upon_reject}</upon_reject>
         <!--Optional:-->
         <urgency>${insert.urgency}</urgency>
         <!--Optional:-->
         <user_input>${insert.user_input}</user_input>
         <!--Optional:-->
         <watch_list>${insert.watch_list}</watch_list>
         <!--Optional:-->
         <work_end>${insert.work_end}</work_end>
         <!--Optional:-->
         <work_notes>${insert.work_notes}</work_notes>
         <!--Optional:-->
         <work_notes_list>${insert.work_notes_list}</work_notes_list>
         <!--Optional:-->
         <work_start>${insert.work_start}</work_start>
      </inc:insert>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>insert</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>Incident Integration [ insert ]</qualified_name>
        <soap_action>http://www.service-now.com/incident/insert</soap_action>
        <soap_endpoint>https://dev272006.service-now.com/incident.do?SOAP</soap_endpoint>
        <soap_message display_value="Incident Integration">efa89952830ba6104ce4b329feaad3d0</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>admin</sys_created_by>
        <sys_created_on>2025-08-01 06:19:33</sys_created_on>
        <sys_id>146a1dd2830ba6104ce4b329feaad383</sys_id>
        <sys_mod_count>1</sys_mod_count>
        <sys_name>insert</sys_name>
        <sys_package display_value="Right Prompt Travel App" source="x_1804233_right_pr">c2f1413183766e104ce4b329feaad353</sys_package>
        <sys_policy/>
        <sys_scope display_value="Right Prompt Travel App">c2f1413183766e104ce4b329feaad353</sys_scope>
        <sys_update_name>sys_soap_message_function_146a1dd2830ba6104ce4b329feaad383</sys_update_name>
        <sys_updated_by>admin</sys_updated_by>
        <sys_updated_on>2025-08-01 06:23:45</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
